public class Main {
    public static void main(String[] args) {
        int price = 20000; // стоимость билета
        int rublesMiles = 20; // количество рублей, за которые начисляется 1 миля

        System.out.println("Количество начисленных миль за купленный билет:");
        System.out.println((price / rublesMiles) + "миль");


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
